/*******************************************************************************
刘禹超
2015.11.6
计费系统
*******************************************************************************/
#include<stdio.h>
#include<time.h>
int main()
{
	int a[100][2]={0};                        //0账号           1余额  
	time_t b[100][2]={0};                     //0登入时间       1登出时间
	int a,b,c,d,x,y;
	while(1)
	{

		printf("请选择您需要的操作（填序号）\n1.注册\n2.登入\n3.登出\n4.查询个人信息5.充值\n");
		scanf("%d",&a);
		if(a==1)
		{
			for(x=0;x<=99;x++)
			{
				if(a[x][0]==0)
				{
					a[x][0]=x;
					printf("恭喜您注册成功！您的账号是jfxt%d\n",x);
					break;
				}
			}
		}
		else if(a==2)
		{
			printf("请输入您的账号jfxt");
			scanf("%d",&b);
			for(x=0;x<=99;x++)
			{
				if(x==b)
				{
					b[x][2]=
				}
			}
		}
		else if(a==3)
		{
		}
		else if(a==4)
		{
		}
		else
		{
		}
		break;
	}
	return 0;
}
